# 1 Задание
n = int(input("Введите значение от 0 до 100 включительно"))
k = 0
b = []
if n <= 100 and n >= 0:
    for x in range(0, n+1):
        b.append(x**3)
else:
    k += 1
    print("Ошибка, попробуйте другое значение")

if k == 0:
    print(sum(b))

#2 Задание

for i in range(1, 10):
    for j in range(1, 10):
        print(f"{i*j :^5}", end="")
    print()

